Revit 2027 API
BuiltInFailures.AssemblyFailures.IneligibleElementsInAssembly Property
 Ineligible elements in assembly.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId IneligibleElementsInAssembly { get; }
Public Shared ReadOnly Property IneligibleElementsInAssembly As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ IneligibleElementsInAssembly {
	FailureDefinitionId^ get ();
}
static member IneligibleElementsInAssembly : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AssemblyFailures Class
Autodesk.Revit.DB Namespace